{
    "blogs": [{
        "title": "Day 1: Beginning a Blog",
        "date": "Monday 2021-02-08",
        "listening": {
            "title": "Daft Punk Unmasked",
            "link": "https://music.youtube.com/playlist?list=RDCLAK5uy_m43PQSgLD_nVZ2TKz0ovoqVNG7hZgZFE8"
        },
        "content": "The 2 main rules for the 100daysofcode.com challenge are 1. Code minimum an hour every day for the next 100 days.; and 2. Tweet your progress every day with the #100DaysOfCode hashtag. One out of two ain't bad.\n\n\n\n\n\nMy goal for today is to edit my portfolio to include a very simple blog section to put these write ups on, deploying with React and Github pages. \n\n\n\n\n\nTASKS FOR TODAY:\n\n\n Reluctantly decide I'm going to take employed-as-a-dev friend's advice and do 100 days of code.\n\n\n Research 100 Days of Code to find out if the rules are doable.\n\n\n OK, sure, there are 2, I can do them and skip Saturdays if I want. \n\n\n I'm not really a joiner, and I don't want to tweet, 'I'm publicly committing to the 100DaysOfCode Challenge starting today! Learn More and Join me! hey @ka11away https://100DaysOfCode.com #100DaysOfCode', so I leave crafting my FYI I'm Doing This Thing tweet for after I've done the hour of coding today. \n\n\n Decide I'll also blog about it and start this Google doc. \n\n\n I'm not going to write more about writing, because, boring. And I won't let Google autocorrect change my bad syntax right there, because, conversational tone, Google autocorrect, get with it.\n\n\n Install Wakatime extension in VS Code to prove I'm spending the time coding\n\n\n Sign into Wakatime with Github\n\n\n Get logged into Github on my new phone\n\n\n Set up Authenticator app on my new phone\n\n\n Realize I've been preparing to write code for an hour now and doing a lot of futzing around. Now...here we go.  \n\n\n When I begin, my portfolio is just a create-react-app with my unspinny face instead of a spinny React icon. The highlight text is bright blue instead of teal. I have already made some Choices, you see.\n\n\n  Those three buttons open models. The projects modal looks fine, but the tech stack and resume are horrifyingly not implemented. \n\n\n I  don't want the blog to be a modal, I want it on its own page. So I'll add an ugly link on the main page and some routing. \n\n\n Quick look at the React Router docs to refresh my knowledge\n\n\n That also means I get to clean up my App component by throwing those three buttons into their own component, named ModalManager. \n\n\n Let me write a stand in component for the blog landing:\n\n\n Next, a blogpost component that opens to a blog detail page\n\n\n The data for a blogpost, for now, will be a JSON object:\n\n\n Title\n\n\n Date\n\n\n Listening to\n\n\n Post content (written in markdown?) For now I'm trying the React Markdown \n\n\n Tags\n\n\n Map through the json and put them all into a blog short post\n\n\n Link to the full blog\n\n\n https://dev.to/dsckiitdev/dynamic-pages-using-react-router-2pm for refresher on react dynamic routing\n\n\n \n\n\n \n\n\n TECH DEBT:\n\n\n Style Nav\n\n\n Make the blog markdown work right and not look horrible\n\n\n Style Blog components\n\n\n Backend with form that supports adding these blog posts from the web <-lol\n\n\n \n\n\n \n\n\n This playlist has way more disco than I expected.",
        "tags": [ "100daysofcode", "React", "ReactRouterDom", "tech debt" ]
    }, {
        "title": "Day 2: CSS Time",
        "date": "Tuesday 2021-02-09",
        "listening": {
            "title": "Daft Punk: TRON: Legacy",
            "link": "https://music.youtube.com/playlist?list=RDCLAK5uy_m43PQSgLD_nVZ2TKz0ovoqVNG7hZgZFE8"
        },
        "content": "\n\n\n\n\n\n'I like to futureproof things', I said to myself over and over again last night, making components stupidly complicated when my end goal was to put one blog post on my website. I've realized a few things: \n\n\n - YAGNI -- as my Kenzie instructor (https://kenzie.academy) would say about future proofing, 'YA AIN'T GONNA NEED IT'. Likely, I won't use this site for more than practice. And if I do, I can change things up later.\n\n\n\n\n\n - THANKS CRIPPLING PERFECTIONISM FOR WASTING MY TIME. I often make goals so lofty that I fail before I start.\n\n\n\n\n\n  - EDITING IS GOOD, but it needs to come after writing--the creative part of the brain is stifled by nitpicking. As Ernest Hemingway didn't say but everyone likes to say he said, 'Write drunk, edit sober.' I need to let the code flow. \n\n\nTODAY'S GOALS\n\n\n - Style the blog landing and blog short post\n\n\n - Stretch goal: style the blog detail page\n\n\n - Stretch Armstrong goal: fix my projects, tech stack, and resume pages because they got borked hard in the last few commits.\n\n\nTODAY'S CHANGELOG\n\n\n - Removed blog placeholder text.\n\n\n\n\n\n - Added blog landing/blog post short CSS files and imported them.\n\n\n\n\n\n - Imported [react-spinners](https://www.npmjs.com/package/react-spinners) library so if my blog doesn't immediately load, we've still got something visually interesting on the page.\n\n\n - [UUID for the keys](https://www.npmjs.com/package/uuid)\n\n\n - Make the BlogPostShort look like a card. Per my own tradition, start by making a border in the color whitesmoke. Of course, consult [css-tricks](https://css-tricks.com)\n\n\n - OK, the blog post short doesn't look as awful. My main issue is that I have to make design decisions, and all I want out of the design is, 'looks OK', which really doesn't help me narrow anything down. Tomorrow, I'm taking some coding time as decision making time.\n\n\nRANDOM THINGS I LEARNED!\n\n\n - GitHub Pages is persnickety. My previous set up followed the [react-gh-pages tutorial](https://github.com/gitname/react-gh-pages) and worked great. Last night, it did not work at all. Switched to [Vercel](https://www.vercel.com) for deployment until I'm less angry at Github pages and willing to troubleshoot.\n\n\n - Gotta make my choices about my personal settings first thing -- music, text editor, whether or not the dog is allowed to sit next to me :D -- or I'll waste a lot of time.\n\n\n\n\n\n Tech debt\n\n\n Importing a txt file or md file is eluding me right now but I'll get to it so we can make react-markdown work.",
        "tags": ["100daysofcode", "React", "uuid", "react-markdown", "tech debt"]
    }]
}